n = input()
nums_1 = ["один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь",  "девять", "десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"]
nums_2 = ["", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"]
nums_3 = ["сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"]
if int(n) < 20:
    print(nums_1[int(n) - 1])
elif int(n) < 100:
    print(nums_2[int(n[0]) - 1], end=" ")
    if n[1] != "0":
        print(nums_1[int(n[1]) - 1])
elif int(n) == 1000:
    print("тысяча")
else:
    print(nums_3[int(n[0]) - 1], end=" ")
    if n[1:] != "00":
        if int(n[1:]) < 20:
            print(nums_1[int(n[1:]) - 1])
        elif n[2] == "0" :
            print(nums_2[int(n[1]) - 1])
        else:
            print(nums_2[int(n[1]) - 1], nums_1[int(n[2]) - 1], sep=" ")